#### We have a dataset of students and the one day of the week that they come for class. The data is in binary form - 1 being they came to class and 0 being they didn't. We want to convert it to tabular data representing student name and which day of the week they attend.

Import Libraries

In [2]:
import pandas as pd
import numpy as np

Load data file containing students and the data of the week they take the class

In [6]:
df = pd.read_excel("day_class.xlsx")
df

  Student  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
0  Ashley       1        0          0         0       0         0       0
1    Beth       1        0          0         0       0         0       0
2   Cathy       0        0          0         0       1         0       0
3   Simon       0        0          0         1       0         0       0
4  Steven       0        0          0         1       0         0       0

Get students and days in week in different dataframes

In [17]:
student = df.iloc[:,0]
days = df.iloc[:, 1:]

In [18]:
student

0    Ashley
1      Beth
2     Cathy
3     Simon
4    Steven
Name: Student, dtype: object

In [19]:
days

   Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
0       1        0          0         0       0         0       0
1       1        0          0         0       0         0       0
2       0        0          0         0       1         0       0
3       0        0          0         1       0         0       0
4       0        0          0         1       0         0       0

In [20]:
#Get which day the class is taken
on_day = days.idxmax(axis = 1) 
on_day

0      Monday
1      Monday
2      Friday
3    Thursday
4    Thursday
dtype: object

Concatenate with students

In [23]:
out = pd.concat([student,on_day],axis=1)
out.columns =['Student', 'Day when class attended']
out

  Student Day when class attended
0  Ashley                  Monday
1    Beth                  Monday
2   Cathy                  Friday
3   Simon                Thursday
4  Steven                Thursday